export const KOREAN_HOLIDAYS: Record<string, string> = {
  '2026-01-01': '신정',
  '2026-02-16': '설날',
  '2026-02-17': '설날',
  '2026-02-18': '설날',
  '2026-03-01': '삼일절',
  '2026-03-02': '삼일절 대체',
  '2026-05-04': '개교기념일',
  '2026-05-05': '어린이날',
  '2026-05-24': '부처님오신날',
  '2026-05-25': '부처님오신날 대체',
  '2026-06-03': '지방선거일',
  '2026-06-06': '현충일',
  '2026-07-17': '제헌절',
  '2026-08-15': '광복절',
  '2026-08-17': '광복절 대체',
  '2026-09-24': '추석',
  '2026-09-25': '추석',
  '2026-09-26': '추석',
  '2026-10-03': '개천절',
  '2026-10-05': '개천절 대체',
  '2026-10-09': '한글날',
  '2026-10-30': '재량휴업일',
  '2026-12-25': '성탄절',
};

export const getKoreanHolidayName = (date: string) =>
  KOREAN_HOLIDAYS[date] ?? null;
